# Faster R-CNN with Resnet-101 (v1) configured for the Oxford-IIIT Pet Dataset.
# Users should configure the fine_tune_checkpoint field in the train config as
# well as the label_map_path and input_path fields in the train_input_reader and
# eval_input_reader. Search for "gs://fingerreader_od/data" to find the fields that
# should be configured.

model {
  faster_rcnn {
    num_classes: 2
    image_resizer {
      keep_aspect_ratio_resizer {
        min_dimension: 600
        max_dimension: 1024
      }
    }
    feature_extractor {
      type: 'faster_rcnn_resnet101'
      first_stage_features_stride: 16
    }
    first_stage_anchor_generator {
      grid_anchor_generator {
        scales: [0.25, 0.5, 1.0, 2.0]
        aspect_ratios: [0.5, 1.0, 2.0]  #no base height and width 
        height_stride: 16
        width_stride: 16
      }
    }
    first_stage_box_predictor_conv_hyperparams {  #here no batch norm 
      op: CONV
      regularizer {
        l2_regularizer {
          weight: 0.0
        }
      }
      initializer {
        truncated_normal_initializer {
          stddev: 0.01
        }
      }
    }
    first_stage_nms_score_threshold: 0.0
    first_stage_nms_iou_threshold: 0.7  #can change this 
    first_stage_max_proposals: 300      #can reduce this 
    first_stage_localization_loss_weight: 2.0   #rpn losss  function 
    first_stage_objectness_loss_weight: 1.0  #rpn loss funtion 
    initial_crop_size: 14                         #?
    maxpool_kernel_size: 2
    maxpool_stride: 2                    #from here it is all about preditning the second stage boxes in order to send them to classify 
    second_stage_box_predictor {
      mask_rcnn_box_predictor {         #to avioid overfit we van use drop out here it's falese 
        use_dropout: false
        dropout_keep_probability: 1.0
        fc_hyperparams {
          op: FC
          regularizer {
            l2_regularizer {
              weight: 0.0
            }
          }
          initializer {
            variance_scaling_initializer {
              factor: 1.0
              uniform: true
              mode: FAN_AVG
            }
          }
        }
      }
    }
    second_stage_post_processing {    #this is used for second stage post processing nms and other things 
      batch_non_max_suppression {
        score_threshold: 0.0
        iou_threshold: 0.6
        max_detections_per_class: 100
        max_total_detections: 300
      }
      score_converter: SOFTMAX
    }
    second_stage_localization_loss_weight: 2.0
    second_stage_classification_loss_weight: 1.0
  }
}

train_config: {   #trainer.train need these params 
  batch_size: 1
  optimizer {
    momentum_optimizer: {
      learning_rate: {
        manual_step_learning_rate {
          initial_learning_rate: 0.0003
          schedule {
            step: 0
            learning_rate: .0003
          }
          schedule {
            step: 900000
            learning_rate: .00003
          }
          schedule {
            step: 1200000
            learning_rate: .000003
          }
        }
      }
      momentum_optimizer_value: 0.9    #can use adam there 
    }
    use_moving_average: false
  }
  gradient_clipping_by_norm: 10.0
  fine_tune_checkpoint: "gs://fingerreader_od/data/model.ckpt"
  from_detection_checkpoint: true
  data_augmentation_options {
    random_horizontal_flip {
    }
  }
}

train_input_reader: {
  tf_record_input_reader {
    input_path: "gs://fingerreader_od/data/pet_train.record"
  }
  label_map_path: "gs://fingerreader_od/data/pet_label_map.pbtxt"
}

eval_config: {
  num_examples: 15
}

eval_input_reader: {
  tf_record_input_reader {
    input_path: "gs://fingerreader_od/data/pet_val.record"
  }
  label_map_path: "gs://fingerreader_od/data/pet_label_map.pbtxt"
  shuffle: False
  num_readers: 1
}
